---
kind: other
id: Methods.T:Autodesk.Revit.DB.HostedSweepType
source: html/0649b43a-e079-545c-ebe0-0257fd808ec5.htm
---
# HostedSweepType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.